//
//  Exercises.swift
//  NeumorphTest
//
//  Created by Анатолий Силиверстов on 25.04.2022.
//

import Foundation

struct Exercises {
    
    static let shared = Exercises()
    
    var chestExercises = ["Жим Свенда", "Жим Свенда с Т-грифом", "Жим Свенда с гантелями лежа", "Жим в кроссовере горизонтально", "Жим в рычажном тренажере от груди вниз", "Жим в рычажном тренажере от груди вверх", "Жим в рычажном тренажере от груди вперед", "Жим гантелей лежа на полу", "Жим гантелей на горизонтальной скамье", "Жим гантелей на наклонной скамье (30 градусов) вверх", "Жим гантелей на наклонной скамье (45 градусов) вверх", "Жим гантелей на наклонной скамье с супинацией (разворотом)", "Жим гантелей на наклонной скамье вниз", "Жим гантелей на горизонтальной скамье одной рукой поочередно", "Жим лежа в кроссовере", "Жим штанги лежа на горизонтальной скамье","Жим штанги лежа на горизонтальной скамье в тренажере Смита", "Жим штанги лежа на наклонной скамье вниз", "Жим штанги лежа на наклонной скамье вверх", "Жим штанги лежа на наклонной скамье вверх в тренажере Смита", "Отжимания на брусьях в гравитроне", "Отжимания на брусьях", "Отжимания", "Пуловер с гантелью", "Разведение гантелей на горизонтальной скамье", "Разведение гантелей на наклонной скамье (30 градусов)", "Разведение гантелей на наклонной скамье (45 градусов)", "Разведение гантелей на наклонной скамье вниз", "Сведение рук в кроссовере лежа на горизонтальной скамье", "Сведение рук в кроссовере лежа на наклонной вверх скамье", "Сведение рук в кроссовере лежа на наклонной вниз скамье", "Сведение рук в кроссовере сверху стоя", "Сведение рук в кроссовере сверху стоя в наклоне", "Сведение рук в кроссовере снизу", "Сведение рук в тренажере Бабочка" ]
}
