//
//  Exercises.swift
//  NeumorphTest
//
//  Created by Анатолий Силиверстов on 25.04.2022.
//

import Foundation

struct Exercises {
    
    static let shared = Exercises()
    
    var chest = ["Жим Свенда", "Жим Свенда с Т-грифом", "Жим Свенда с гантелями лежа", "Жим в кроссовере горизонтально", "Жим в рычажном тренажере от груди вниз", "Жим в рычажном тренажере от груди вверх", "Жим в рычажном тренажере от груди вперед", "Жим гантелей лежа на полу", "Жим гантелей на горизонтальной скамье", "Жим гантелей на наклонной скамье (30 градусов) вверх", "Жим гантелей на наклонной скамье (45 градусов) вверх", "Жим гантелей на наклонной скамье с супинацией (разворотом)", "Жим гантелей на наклонной скамье вниз", "Жим гантелей на горизонтальной скамье одной рукой поочередно", "Жим лежа в кроссовере", "Жим штанги лежа на горизонтальной скамье","Жим штанги лежа на горизонтальной скамье в тренажере Смита", "Жим штанги лежа на наклонной скамье вниз", "Жим штанги лежа на наклонной скамье вверх", "Жим штанги лежа на наклонной скамье вверх в тренажере Смита", "Отжимания на брусьях в гравитроне", "Отжимания на брусьях", "Отжимания", "Пуловер с гантелью", "Разведение гантелей на горизонтальной скамье", "Разведение гантелей на наклонной скамье (30 градусов)", "Разведение гантелей на наклонной скамье (45 градусов)", "Разведение гантелей на наклонной скамье вниз", "Сведение рук в кроссовере лежа на горизонтальной скамье", "Сведение рук в кроссовере лежа на наклонной вверх скамье", "Сведение рук в кроссовере лежа на наклонной вниз скамье", "Сведение рук в кроссовере сверху стоя", "Сведение рук в кроссовере сверху стоя в наклоне", "Сведение рук в кроссовере снизу", "Сведение рук в тренажере Бабочка" ]
    
    var shoulders = ["Жим штанги сидя за голову", "Жим штанги сидя перед собой", "Жим штанги сидя за голову в транежере Смита", "Жим штанги сидя перед собой в тренажере Смита", "Жим гантелей сидя", "Жим гантелей сидя с супинацией(разворотом) Жим Арнольда", "Подьем гантелей перед собой одновременно", "Подьем гантелей перед собой поочередно", "Подьем штанги перед собой", "Подьем блина перед собой", "Тяга перед собой в кроссовере", "Тяга изогнутой штанги к побородку", "Тяга к подбородку в кроссовере"]
    var back = [""]
    var biceps = [""]
    var triceps = [""]
    var legs = [""]
    var abs = [""]
    var cardio = [""]
    var forearms = [""]
    var fitness = [""]
    
    let exerciseGroups = ["Грудь", "Плечи", "Спина", "Бицепс", "Трицепс", "Ноги", "Пресс", "Предплечья", "Кардио"]
}
